
#include<stdio.h>
#include<stdlib.h>

#define ROW 11
#define COL 11
//void Game(){
//第一步,构建 10X10 棋盘
//	Init();
//
//	while (1)
//	{
//	
//
//	}
//}

void Start(){
	printf("******************************\n");
	printf("******************************\n");
	printf("*          1.开始游戏        *\n");
	printf("*          0.结束游戏        *\n");
	printf("******************************\n");
	printf("******************************\n");
	int a = -1;
	while (1){
		scanf("%d", a);
		if (a > 1 || a < 0){
			printf("输入错误!请重新输入:");
			continue;
		}
		if (a == 1)
		{
			Game();
		}
		if (a == 0){
			break;
		}
	}
}
int main(){
	Start();
	system("pause");
	return 0;
}
//小游戏扫雷的实现:
// 扫雷的游戏规则:在一个棋盘中的任意几处隐藏着地雷,随意翻开一个格子,
//若该处无地雷,则显示相邻八个格子中藏有地雷的数目,若显示为 0则翻开该格子后将八个格子全部翻开,直到翻开大于0的数字为止.
//若翻开地雷,则游戏结束,并将所有地雷显示出来.
//实现算法分析:
//一.构建一个10 x 10 的棋盘.
//二.将棋盘分为两个部分,真实的棋盘与显示给玩家的棋盘.:
//真实的棋盘用于游戏的进行(玩家的操作及判断游戏是否结束),将用于显示的棋盘给玩家打印;
//三.构建游戏主体,
//四.构建判断函数